roboter/Hardware/STM32/STM32F103C8T6_DEV/V2.4/3.5版 库函数 TFT驱动9325+9341系列/ucosII/uCOSII+uCGUI 系统运行展示目前仅支持9325 9320 9328/uCOSII+uCGUI/Source/uCGUI/LCDDriver/ili9320.c
#include "stm32f10x_lib.h"
#include "ili9320.h"
#include "ili9320_font.h"

//#define ili9320_WriteData(x)\
//{GPIOB->ODR=((GPIOB->ODR&0x00ff)|(x<<8));\
//GPIOC->ODR=((GPIOC->ODR&0xff00)|(x>>8));}

u16 DeviceCode;

void Lcd_Configuration(void)
{ 
   GPIO_InitTypeDef  GPIO_InitStructure;					 //定义GPIO结构体


 //PB 0-15做为数据口 所以要关掉 PB上的JTAG仿真 	只开启SWJ仿真
 RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);	  //启动AFIO时钟
 GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE); //配置JTAG-DP Disabled and SW-DP Enabled 
 
 	
 RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB|RCC_APB2Periph_GPIOC, ENABLE);	//使能PC端口时钟
	
 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;			 //端口配置
 GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 		 //推挽输出
 GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		 //IO口速度为50MHz
 GPIO_Init(GPIOB, &GPIO_InitStructure);					 //根据设定参数初始化GPIOC.13
 GPIO_SetBits(GPIOB,GPIO_Pin_All);						 //PB.5 输出高


 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10;
 GPIO_Init(GPIOC, &GPIO_InitStructure);

 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15; 
 GPIO_Init(GPIOA, &GPIO_InitStructure);


} 


////寄存器方法
//
////引脚定义
//void Set_Rs(void)		   //命令/数据,0=命令,1=数据
//{
//  GPIOC->BSRR|=GPIO_Pin_9;
//}
//void Clr_Rs(void)
//{
//  GPIOC->BRR|=GPIO_Pin_9;
//}     
//          		
//							   
//void Set_nWr(void)		   //写数据
//{
//  GPIOC->BSRR|=GPIO_Pin_10;
//}
//void Clr_nWr(void)
//{
//  GPIOC->BRR|=GPIO_Pin_10;
//}                  
//
//
//void Set_nRd(void)		   //读数据
//{									   
//  GPIOA->BSRR|=GPIO_Pin_15;
//}
//void Clr_nRd(void)
//{
//  GPIOA->BRR|=GPIO_Pin_15;
//}                   
//
// 
//void Set_Cs(void)	   //片选
//{
//  GPIOC->BSRR|=GPIO_Pin_8;
// }
//
//void Clr_Cs(void)
//{
//  GPIOC->BRR|=GPIO_Pin_8;
//}  



/****************************************************************************
* 名    称：void ili9320_Initializtion()
* 功    能：初始化 ILI9320 控制器
* 入口参数：无
* 出口参数：无
* 说    明：
* 调用方法：ili9320_Initializtion();
****************************************************************************/
void ili9320_Initializtion()
{
  /*****************************
  **    硬件连接说明          **
  ** STM32         ili9320    **
  ** PE0~15 <----> DB0~15     **
  ** PD15   <----> nRD        **
  ** PD14   <----> RS         **
  ** PD13   <----> nWR        **
  ** PD12   <----> nCS        **
  ** PD11   <----> nReset     **
  ** PC0    <----> BK_LED     **
  ******************************/
 	u16 i;

  	ili9320_WriteData(0xffff);
	Clr_Cs();
//  	Set_Rst;
	Set_nWr();
	Set_Cs();
	Set_Rs();
	Set_nRd();
//	Set_Rst;
//  ili9320_Reset();                                        // 复位 ili9320_Reset
  for(i=50000;i>0;i--);
  for(i=50000;i>0;i--);
  for(i=50000;i>0;i--);
  ili9320_WriteRegister(0x0000,0x0001);ili9320_Delay(10000);
  for(i=50000;i>0;i--);
  for(i=50000;i>0;i--);
  DeviceCode = ili9320_ReadRegister(0x0000);
	if(DeviceCode==0x9325||DeviceCode==0x9328)
	{
 		ili9320_WriteRegister(0x00e5,0x78F0);      
//        ili9320_WriteRegister(0x0000,0x0001);
        ili9320_WriteRegister(0x0001,0x0100);     
        ili9320_WriteRegister(0x0002,0x0700);                   
        ili9320_WriteRegister(0x0003,0x1030);    
        ili9320_WriteRegister(0x0004,0x0000);                                   
        ili9320_WriteRegister(0x0008,0x0202);	           
        ili9320_WriteRegister(0x0009,0x0000);         
        ili9320_WriteRegister(0x000a,0x0000);         
        ili9320_WriteRegister(0x000c,0x0001);         
        ili9320_WriteRegister(0x000d,0x0000);          
        ili9320_WriteRegister(0x000f,0x0000);
//Power On sequence //
        ili9320_WriteRegister(0x0010,0x0000);   
        ili9320_WriteRegister(0x0011,0x0007);
        ili9320_WriteRegister(0x0012,0x0000);                                                                 
        ili9320_WriteRegister(0x0013,0x0000);
        ili9320_WriteRegister(0x0007,0x0001);                 
        for(i=50000;i>0;i--);
		for(i=50000;i>0;i--);
        ili9320_WriteRegister(0x0010,0x1690);   
        ili9320_WriteRegister(0x0011,0x0227);
        for(i=50000;i>0;i--);
		for(i=50000;i>0;i--);
        ili9320_WriteRegister(0x0012,0x009d);                  
        for(i=50000;i>0;i--);
		for(i=50000;i>0;i--);
        ili9320_WriteRegister(0x0013,0x1900);   
        ili9320_WriteRegister(0x0029,0x0025);
        ili9320_WriteRegister(0x002b,0x000d);
        for(i=50000;i>0;i--);
		for(i=50000;i>0;i--);
        ili9320_WriteRegister(0x0020,0x0000);                                                            
        ili9320_WriteRegister(0x0021,0x0000);           
///////////////////////////////////////////////////////      
        for(i=50000;i>0;i--);
		for(i=50000;i>0;i--);
        ili9320_WriteRegister(0x0030,0x0007); 
        ili9320_WriteRegister(0x0031,0x0303);   
        ili9320_WriteRegister(0x0032,0x0003);
        ili9320_WriteRegister(0x0035,0x0206);
        ili9320_WriteRegister(0x0036,0x0008); 
        ili9320_WriteRegister(0x0037,0x0406);
        ili9320_WriteRegister(0x0038,0x0304);        
        ili9320_WriteRegister(0x0039,0x0007);     
        ili9320_WriteRegister(0x003c,0x0602);
        ili9320_WriteRegister(0x003d,0x0008);
        for(i=50000;i>0;i--);
		for(i=50000;i>0;i--);
        ili9320_WriteRegister(0x0050,0x0000);
        ili9320_WriteRegister(0x0051,0x00ef);                   
        ili9320_WriteRegister(0x0052,0x0000);                   
        ili9320_WriteRegister(0x0053,0x013f); 
        
        ili9320_WriteRegister(0x0060,0xa700);        
        ili9320_WriteRegister(0x0061,0x0001); 
        ili9320_WriteRegister(0x006a,0x0000);
        ili9320_WriteRegister(0x0080,0x0000);
        ili9320_WriteRegister(0x0081,0x0000);
        ili9320_WriteRegister(0x0082,0x0000);
        ili9320_WriteRegister(0x0083,0x0000);
        ili9320_WriteRegister(0x0084,0x0000);
        ili9320_WriteRegister(0x0085,0x0000);
      
        ili9320_WriteRegister(0x0090,0x0010);     
        ili9320_WriteRegister(0x0092,0x0600);  
		   
