roboter/Hardware/STM32/STM32F103C8T6_DEV/V2.4/3.5版 库函数 TFT驱动9325+9341系列/ucosII/uCOSII+uCGUI 系统运行展示目前仅支持9325 9320 9328/uCOSII+uCGUI/Source/uCGUI/LCDDriver/ili9320.c
        ili9320_WriteRegister(0x0007,0x0133);
	}
	else
	{
	
		Lcd_WR_Reg(0xCF);  
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0xC1); 
		Lcd_Write_Data(0X30); 
		Lcd_WR_Reg(0xED);  
		Lcd_Write_Data(0x64); 
		Lcd_Write_Data(0x03); 
		Lcd_Write_Data(0X12); 
		Lcd_Write_Data(0X81); 
		Lcd_WR_Reg(0xE8);  
		Lcd_Write_Data(0x85); 
		Lcd_Write_Data(0x10); 
		Lcd_Write_Data(0x7A); 
		Lcd_WR_Reg(0xCB);  
		Lcd_Write_Data(0x39); 
		Lcd_Write_Data(0x2C); 
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0x34); 
		Lcd_Write_Data(0x02); 
		Lcd_WR_Reg(0xF7);  
		Lcd_Write_Data(0x20); 
		Lcd_WR_Reg(0xEA);  
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0x00); 
		Lcd_WR_Reg(0xC0);    //Power control 
		Lcd_Write_Data(0x1B);   //VRH[5:0] 
		Lcd_WR_Reg(0xC1);    //Power control 
		Lcd_Write_Data(0x01);   //SAP[2:0];BT[3:0] 
		Lcd_WR_Reg(0xC5);    //VCM control 
		Lcd_Write_Data(0x30); 	 //3F
		Lcd_Write_Data(0x30); 	 //3C
		Lcd_WR_Reg(0xC7);    //VCM control2 
		Lcd_Write_Data(0XB7); 
		Lcd_WR_Reg(0x36);    // Memory Access Control 	   saomiao
		Lcd_Write_Data(0x08); 
		Lcd_WR_Reg(0x3A);   
		Lcd_Write_Data(0x55); 
		Lcd_WR_Reg(0xB1);   
		Lcd_Write_Data(0x00);   
		Lcd_Write_Data(0x1A); 
		Lcd_WR_Reg(0xB6);    // Display Function Control 
		Lcd_Write_Data(0x0A); 
		Lcd_Write_Data(0xA2); 
		Lcd_WR_Reg(0xF2);    // 3Gamma Function Disable 
		Lcd_Write_Data(0x00); 
		Lcd_WR_Reg(0x26);    //Gamma curve selected 
		Lcd_Write_Data(0x01); 
		Lcd_WR_Reg(0xE0);    //Set Gamma 
		Lcd_Write_Data(0x0F); 
		Lcd_Write_Data(0x2A); 
		Lcd_Write_Data(0x28); 
		Lcd_Write_Data(0x08); 
		Lcd_Write_Data(0x0E); 
		Lcd_Write_Data(0x08); 
		Lcd_Write_Data(0x54); 
		Lcd_Write_Data(0XA9); 
		Lcd_Write_Data(0x43); 
		Lcd_Write_Data(0x0A); 
		Lcd_Write_Data(0x0F); 
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0x00); 		 
		Lcd_WR_Reg(0XE1);    //Set Gamma 
		Lcd_Write_Data(0x00); 
		Lcd_Write_Data(0x15); 
		Lcd_Write_Data(0x17); 
		Lcd_Write_Data(0x07); 
		Lcd_Write_Data(0x11); 
		Lcd_Write_Data(0x06); 
		Lcd_Write_Data(0x2B); 
		Lcd_Write_Data(0x56); 
		Lcd_Write_Data(0x3C); 
		Lcd_Write_Data(0x05); 
		Lcd_Write_Data(0x10); 
		Lcd_Write_Data(0x0F); 
		Lcd_Write_Data(0x3F); 
		Lcd_Write_Data(0x3F); 
		Lcd_Write_Data(0x0F); 
		Lcd_WR_Reg(0x2B); 
		Lcd_Write_Data(0x00);
		Lcd_Write_Data(0x00);
		Lcd_Write_Data(0x01);
		Lcd_Write_Data(0x3f);
		Lcd_WR_Reg(0x2A); 
		Lcd_Write_Data(0x00);
		Lcd_Write_Data(0x00);
		Lcd_Write_Data(0x00);
		Lcd_Write_Data(0xef);	 
		Lcd_WR_Reg(0x11); //Exit Sleep
		for(i=50000;i>0;i--);
		Lcd_WR_Reg(0x29); //display on		
	
	}

//	else if(DeviceCode==0x9320)
//	{
//		ili9320_WriteRegister(0x00,0x0000);
//		ili9320_WriteRegister(0x01,0x0100);	//Driver Output Contral.
//		ili9320_WriteRegister(0x02,0x0700);	//LCD Driver Waveform Contral.
////		ili9320_WriteRegister(0x03,0x1030);	//Entry Mode Set.
//		ili9320_WriteRegister(0x03,0x1018);	//Entry Mode Set.
//	
//		ili9320_WriteRegister(0x04,0x0000);	//Scalling Contral.
//		ili9320_WriteRegister(0x08,0x0202);	//Display Contral 2.(0x0207)
//		ili9320_WriteRegister(0x09,0x0000);	//Display Contral 3.(0x0000)
//		ili9320_WriteRegister(0x0a,0x0000);	//Frame Cycle Contal.(0x0000)
//		ili9320_WriteRegister(0x0c,(1<<0));	//Extern Display Interface Contral 1.(0x0000)
//		ili9320_WriteRegister(0x0d,0x0000);	//Frame Maker Position.
//		ili9320_WriteRegister(0x0f,0x0000);	//Extern Display Interface Contral 2.
//	
//		for(i=50000;i>0;i--);
//		for(i=50000;i>0;i--);
//		ili9320_WriteRegister(0x07,0x0101);	//Display Contral.
//		for(i=50000;i>0;i--);
//		for(i=50000;i>0;i--);
//	
//		ili9320_WriteRegister(0x10,(1<<12)|(0<<8)|(1<<7)|(1<<6)|(0<<4));	//Power Control 1.(0x16b0)
//		ili9320_WriteRegister(0x11,0x0007);								//Power Control 2.(0x0001)
//		ili9320_WriteRegister(0x12,(1<<8)|(1<<4)|(0<<0));					//Power Control 3.(0x0138)
//		ili9320_WriteRegister(0x13,0x0b00);								//Power Control 4.
//		ili9320_WriteRegister(0x29,0x0000);								//Power Control 7.
//	
//		ili9320_WriteRegister(0x2b,(1<<14)|(1<<4));
//		
//		ili9320_WriteRegister(0x50,0);		//Set X Start.
//		ili9320_WriteRegister(0x51,239);	//Set X End.
//		ili9320_WriteRegister(0x52,0);		//Set Y Start.
//		ili9320_WriteRegister(0x53,319);	//Set Y End.
//	
//		ili9320_WriteRegister(0x60,0x2700);	//Driver Output Control.
//		ili9320_WriteRegister(0x61,0x0001);	//Driver Output Control.
//		ili9320_WriteRegister(0x6a,0x0000);	//Vertical Srcoll Control.
//	
//		ili9320_WriteRegister(0x80,0x0000);	//Display Position? Partial Display 1.
//		ili9320_WriteRegister(0x81,0x0000);	//RAM Address Start? Partial Display 1.
//		ili9320_WriteRegister(0x82,0x0000);	//RAM Address End-Partial Display 1.
//		ili9320_WriteRegister(0x83,0x0000);	//Displsy Position? Partial Display 2.
//		ili9320_WriteRegister(0x84,0x0000);	//RAM Address Start? Partial Display 2.
//		ili9320_WriteRegister(0x85,0x0000);	//RAM Address End? Partial Display 2.
//	
//		ili9320_WriteRegister(0x90,(0<<7)|(16<<0));	//Frame Cycle Contral.(0x0013)
//		ili9320_WriteRegister(0x92,0x0000);	//Panel Interface Contral 2.(0x0000)
//		ili9320_WriteRegister(0x93,0x0001);	//Panel Interface Contral 3.
//		ili9320_WriteRegister(0x95,0x0110);	//Frame Cycle Contral.(0x0110)
//		ili9320_WriteRegister(0x97,(0<<8));	//
//		ili9320_WriteRegister(0x98,0x0000);	//Frame Cycle Contral.
//
//	
//		ili9320_WriteRegister(0x07,0x0173);	//(0x0173)
//	}
//	else if(DeviceCode==0x9919)
//	{
//		//------POWER ON &RESET DISPLAY OFF
//		 ili9320_WriteRegister(0x28,0x0006);
//		
//		 ili9320_WriteRegister(0x00,0x0001);
//		
//		 ili9320_WriteRegister(0x10,0x0000);
//		
//		 ili9320_WriteRegister(0x01,0x72ef);
//
//		 ili9320_WriteRegister(0x02,0x0600);
//
//		 ili9320_WriteRegister(0x03,0x6a38);
//		
//		 ili9320_WriteRegister(0x11,0x6874);//70
//		
//		 
//		     //  RAM WRITE DATA MASK
//		 ili9320_WriteRegister(0x0f,0x0000); 
//		    //  RAM WRITE DATA MASK
//		 ili9320_WriteRegister(0x0b,0x5308); 
//		
//		 ili9320_WriteRegister(0x0c,0x0003);
//		
//		 ili9320_WriteRegister(0x0d,0x000a);
//		
//		 ili9320_WriteRegister(0x0e,0x2e00);  //0030
//		
//		 ili9320_WriteRegister(0x1e,0x00be);
//		
//		 ili9320_WriteRegister(0x25,0x8000);
//		
//		 ili9320_WriteRegister(0x26,0x7800);
//		
//		 ili9320_WriteRegister(0x27,0x0078);
//		
//		 ili9320_WriteRegister(0x4e,0x0000);
//		
//		 ili9320_WriteRegister(0x4f,0x0000);
//		
//		 ili9320_WriteRegister(0x12,0x08d9);
//		
//		 // -----------------Adjust the Gamma Curve----//
//		 ili9320_WriteRegister(0x30,0x0000);	 //0007
//		
//		 ili9320_WriteRegister(0x31,0x0104);	   //0203
//		
//		 ili9320_WriteRegister(0x32,0x0100);		//0001
//
//		 ili9320_WriteRegister(0x33,0x0305);	  //0007
//
//		 ili9320_WriteRegister(0x34,0x0505);	  //0007
//		
//		 ili9320_WriteRegister(0x35,0x0305);		 //0407
//		
//		 ili9320_WriteRegister(0x36,0x0707);		 //0407
//		
//		 ili9320_WriteRegister(0x37,0x0300);		  //0607
//		
//		 ili9320_WriteRegister(0x3a,0x1200);		 //0106
//		
//		 ili9320_WriteRegister(0x3b,0x0800);		 
//
//		 ili9320_WriteRegister(0x07,0x0033);
//	} 
/*	else if(DeviceCode==0x9331)
	{
	 	//POWER ON &RESET DISPLAY OFF///////////
		// Start Initial Sequence //////////
		ili9320_WriteRegister(0x00E7, 0x1014);
		ili9320_WriteRegister(0x0001, 0x0100); // set SS and SM bit   0x0100
		ili9320_WriteRegister(0x0002, 0x0200); // set 1 line inversion
		ili9320_WriteRegister(0x0003, 0x1030); // set GRAM write direction and BGR=1.     0x1030
		ili9320_WriteRegister(0x0008, 0x0202); // set the back porch and front porch
		ili9320_WriteRegister(0x0009, 0x0000); // set non-display area refresh cycle ISC[3:0]
		ili9320_WriteRegister(0x000A, 0x0000); // FMARK function
		ili9320_WriteRegister(0x000C, 0x0000); // RGB interface setting
		ili9320_WriteRegister(0x000D, 0x0000); // Frame marker Position
		ili9320_WriteRegister(0x000F, 0x0000); // RGB interface polarity
		//Power On sequence 
		ili9320_WriteRegister(0x0010, 0x0000); // SAP, BT[3:0], AP, DSTB, SLP, STB
		ili9320_WriteRegister(0x0011, 0x0007); // DC1[2:0], DC0[2:0], VC[2:0]
		ili9320_WriteRegister(0x0012, 0x0000); // VREG1OUT voltage
		ili9320_WriteRegister(0x0013, 0x0000); // VDV[4:0] for VCOM amplitude
		ili9320_Delay(200); // Dis-charge capacitor power voltage
		ili9320_WriteRegister(0x0010, 0x1690); // SAP, BT[3:0], AP, DSTB, SLP, STB
		ili9320_WriteRegister(0x0011, 0x0227); // DC1[2:0], DC0[2:0], VC[2:0]
		ili9320_Delay(50); // Delay 50ms
		ili9320_WriteRegister(0x0012, 0x000C); // Internal reference voltage= Vci;
		ili9320_Delay(50); // Delay 50ms
		ili9320_WriteRegister(0x0013, 0x0800); // Set VDV[4:0] for VCOM amplitude
		ili9320_WriteRegister(0x0029, 0x0011); // Set VCM[5:0] for VCOMH
		ili9320_WriteRegister(0x002B, 0x000B); // Set Frame Rate
		ili9320_Delay(50); // Delay 50ms
		ili9320_WriteRegister(0x0020, 0x0000); // GRAM horizontal Address
		ili9320_WriteRegister(0x0021, 0x0000); // GRAM Vertical Address
		// ----------- Adjust the Gamma Curve ----------//
		ili9320_WriteRegister(0x0030, 0x0000);
		ili9320_WriteRegister(0x0031, 0x0106);
		ili9320_WriteRegister(0x0032, 0x0000);
		ili9320_WriteRegister(0x0035, 0x0204);
		ili9320_WriteRegister(0x0036, 0x160A);
		ili9320_WriteRegister(0x0037, 0x0707);
		ili9320_WriteRegister(0x0038, 0x0106);
		ili9320_WriteRegister(0x0039, 0x0707);
		ili9320_WriteRegister(0x003C, 0x0402);
		ili9320_WriteRegister(0x003D, 0x0C0F);
		//------------------ Set GRAM area ---------------//
		ili9320_WriteRegister(0x0050, 0x0000); // Horizontal GRAM Start Address
		ili9320_WriteRegister(0x0051, 0x00EF); // Horizontal GRAM End Address
		ili9320_WriteRegister(0x0052, 0x0000); // Vertical GRAM Start Address
		ili9320_WriteRegister(0x0053, 0x013F); // Vertical GRAM Start Address
		ili9320_WriteRegister(0x0060, 0x2700); // Gate Scan Line
		ili9320_WriteRegister(0x0061, 0x0001); // NDL,VLE, REV
		ili9320_WriteRegister(0x006A, 0x0000); // set scrolling line
		//-------------- Partial Display Control ---------//
		ili9320_WriteRegister(0x0080, 0x0000);
		ili9320_WriteRegister(0x0081, 0x0000);
		ili9320_WriteRegister(0x0082, 0x0000);
		ili9320_WriteRegister(0x0083, 0x0000);
		ili9320_WriteRegister(0x0084, 0x0000);
		ili9320_WriteRegister(0x0085, 0x0000);
		//-------------- Panel Control -------------------//
		ili9320_WriteRegister(0x0090, 0x0010);
		ili9320_WriteRegister(0x0092, 0x0600);
		ili9320_WriteRegister(0x0007,0x0021);		
		ili9320_Delay(50);
		ili9320_WriteRegister(0x0007,0x0061);
		ili9320_Delay(50);
		ili9320_WriteRegister(0x0007,0x0133);  // 262K color and display ON
		ili9320_Delay(50);
	} 								   */
//	else if(DeviceCode==0x4531)
//	{		
//		// Setup display
//		ili9320_WriteRegister(0x00,0x0001);
//	    ili9320_WriteRegister(0x10,0x0628);
//	    ili9320_WriteRegister(0x12,0x0006);
//	    ili9320_WriteRegister(0x13,0x0A32);
//	    ili9320_WriteRegister(0x11,0x0040);
//	    ili9320_WriteRegister(0x15,0x0050);
//	    ili9320_WriteRegister(0x12,0x0016);
//	    ili9320_Delay(15);
//	    ili9320_WriteRegister(0x10,0x5660);
//	    ili9320_Delay(15);
//	    ili9320_WriteRegister(0x13,0x2A4E);
//	    ili9320_WriteRegister(0x01,0x0100);
//	    ili9320_WriteRegister(0x02,0x0300);
//	
//	    ili9320_WriteRegister(0x03,0x1030);
////	    ili9320_WriteRegister(0x03,0x1038);
//	
//	    ili9320_WriteRegister(0x08,0x0202);
//	    ili9320_WriteRegister(0x0A,0x0000);
//	    ili9320_WriteRegister(0x30,0x0000);
//	    ili9320_WriteRegister(0x31,0x0402);
//	    ili9320_WriteRegister(0x32,0x0106);
//	    ili9320_WriteRegister(0x33,0x0700);
//	    ili9320_WriteRegister(0x34,0x0104);
//	    ili9320_WriteRegister(0x35,0x0301);
//	    ili9320_WriteRegister(0x36,0x0707);
//	    ili9320_WriteRegister(0x37,0x0305);
//	    ili9320_WriteRegister(0x38,0x0208);
//	    ili9320_WriteRegister(0x39,0x0F0B);
//	    ili9320_Delay(15);
//	    ili9320_WriteRegister(0x41,0x0002);
//	    ili9320_WriteRegister(0x60,0x2700);
//	    ili9320_WriteRegister(0x61,0x0001);
//	    ili9320_WriteRegister(0x90,0x0119);
//	    ili9320_WriteRegister(0x92,0x010A);
//	    ili9320_WriteRegister(0x93,0x0004);
//	    ili9320_WriteRegister(0xA0,0x0100);
////	    ili9320_WriteRegister(0x07,0x0001);
//	    ili9320_Delay(15);
////	    ili9320_WriteRegister(0x07,0x0021); 
//	    ili9320_Delay(15);
////	    ili9320_WriteRegister(0x07,0x0023);
//	    ili9320_Delay(15);
////	    ili9320_WriteRegister(0x07,0x0033);
//	    ili9320_Delay(15);
//	    ili9320_WriteRegister(0x07,0x0133);
//	    ili9320_Delay(15);
//	    ili9320_WriteRegister(0xA0,0x0000);
//	    ili9320_Delay(20);
//	} 									   
//	else if(DeviceCode==0x7783)
//	{
//		// Start Initial Sequence
//		ili9320_WriteRegister(0x00FF,0x0001);
//		ili9320_WriteRegister(0x00F3,0x0008);
//		ili9320_WriteRegister(0x0001,0x0100);
//		ili9320_WriteRegister(0x0002,0x0700);
//		ili9320_WriteRegister(0x0003,0x1030);  //0x1030
//		ili9320_WriteRegister(0x0008,0x0302);
//		ili9320_WriteRegister(0x0008,0x0207);
//		ili9320_WriteRegister(0x0009,0x0000);
//		ili9320_WriteRegister(0x000A,0x0000);
//		ili9320_WriteRegister(0x0010,0x0000);  //0x0790
//		ili9320_WriteRegister(0x0011,0x0005);
//		ili9320_WriteRegister(0x0012,0x0000);
//		ili9320_WriteRegister(0x0013,0x0000);
//		ili9320_Delay(50);
//		ili9320_WriteRegister(0x0010,0x12B0);
//		ili9320_Delay(50);
//		ili9320_WriteRegister(0x0011,0x0007);
//		ili9320_Delay(50);
//		ili9320_WriteRegister(0x0012,0x008B);
//		ili9320_Delay(50);
//		ili9320_WriteRegister(0x0013,0x1700);
//		ili9320_Delay(50);
//		ili9320_WriteRegister(0x0029,0x0022);
//		
//		//################# void Gamma_Set(void) ####################//
//		ili9320_WriteRegister(0x0030,0x0000);
//		ili9320_WriteRegister(0x0031,0x0707);
//		ili9320_WriteRegister(0x0032,0x0505);
//		ili9320_WriteRegister(0x0035,0x0107);
//		ili9320_WriteRegister(0x0036,0x0008);
//		ili9320_WriteRegister(0x0037,0x0000);
//		ili9320_WriteRegister(0x0038,0x0202);
//		ili9320_WriteRegister(0x0039,0x0106);
//		ili9320_WriteRegister(0x003C,0x0202);
//		ili9320_WriteRegister(0x003D,0x0408);
//		ili9320_Delay(50);
//		
//		
//		ili9320_WriteRegister(0x0050,0x0000);		
//		ili9320_WriteRegister(0x0051,0x00EF);		
//		ili9320_WriteRegister(0x0052,0x0000);		
//		ili9320_WriteRegister(0x0053,0x013F);		
//		ili9320_WriteRegister(0x0060,0xA700);		
//		ili9320_WriteRegister(0x0061,0x0001);
//		ili9320_WriteRegister(0x0090,0x0033);				
//		ili9320_WriteRegister(0x002B,0x000B);		
//		ili9320_WriteRegister(0x0007,0x0133);
//		ili9320_Delay(50);
//	}  
	/*
	else if(DeviceCode==0x1505)
	{
// second release on 3/5  ,luminance is acceptable,water wave appear during camera preview
        ili9320_WriteRegister(0x0007,0x0000);
        ili9320_Delay(5);
        ili9320_WriteRegister(0x0012,0x011C);//0x011A   why need to set several times?
        ili9320_WriteRegister(0x00A4,0x0001);//NVM
    //
        ili9320_WriteRegister(0x0008,0x000F);
        ili9320_WriteRegister(0x000A,0x0008);
        ili9320_WriteRegister(0x000D,0x0008);
       
